In [1]:
# Let's Learn to import library first

import sqlite3

In [21]:
sqlconnection=sqlite3.connect("C:\\Users\Geetu Sodhi\\Desktop\Teacher.db")

cursor=sqlconnection.cursor()

print("Database connected successfully")

query=""" SELECT * FROM Employee """

cursor.execute(query)
    
#cursor.fetchall() fetches all the rows of a query result. It returns all the rows as a list of tuples. 
#An empty list is returned if there is no record to fetch

records=cursor.fetchall()
    
print("Number of records: ",len(records))
    
print(records)
print()
    
for row in records:
    print(row[0],end=" ")
    print(row[1],end=" ")
    print(row[2],end=" ")
    print()

Database connected successfully
Number of records:  7
[(1, 'Geetu', 34.6, 'hhh', 'D01'), (2, None, 56.7, 'hhh', 'D02'), (101, None, 4000.0, 'Software Developer', 'D01'), (102, 'Alazar', 3500.0, 'Business Analyst', 'D01'), (103, 'Ishan', 4200.0, 'Technical Lead', 'D01'), (104, 'Katie', 4500.0, 'Proffesional Coordinator', 'D02'), (105, 'Jenet', 4500.0, 'Personal Dev', 'D03')]

1 Geetu 34.6
2 None 56.7
101 None 4000.0
102 Alazar 3500.0
103 Ishan 4200.0
104 Katie 4500.0
105 Jenet 4500.0

In [26]:
#We will write our code within try catch block to establish connection (without dataframe)

try:
    sqlconnection=sqlite3.connect("C:\\Users\Geetu Sodhi\\Desktop\Teacher.db")
    cursor=sqlconnection.cursor()
    
    print("Database connected successfully")
    
    query="""SELECT * FROM Employee where eid=105 """
    
    cursor.execute(query)
    
#cursor.fetchall() fetches all the rows of a query result. It returns all the rows as a list of tuples. 
#An empty list is returned if there is no record to fetch

    records=cursor.fetchall()
    
    print("Number of records: ",len(records))
    
    print(records)
    print()
    
    for row in records:
        print(row[0],end=" ")
        print(row[1],end=" ")
        print(row[2],end=" ")
        print(row[3],end=" ")
        print(row[4],end=" ")
        print()
except sqlite3.Error as error:
    print("Error",error.args)
finally:
    sqlconnection.close()

Database connected successfully
Number of records:  1
[(105, 'Jenet', 4500.0, 'Personal Dev', 'D03')]

105 Jenet 4500.0 Personal Dev D03

In [30]:
#Lets see the benefit of using dataframe and add a condition

import pandas as pd
try:
    sqlconnection=sqlite3.connect("C:\\Users\Geetu Sodhi\\Desktop\Teacher.db")
    cursor=sqlconnection.cursor()
    print("Database connected successfully")
    query="""SELECT * FROM Employee where Name='Geetu' """
    cursor.execute(query)
#cursor.fetchone() method returns a single record or None if no more rows are available.   
   
    df = pd.DataFrame(cursor.fetchall())
    print (df)
except sqlite3.Error as error:
    print("Error")

Database connected successfully
   0      1     2    3    4
0  1  Geetu  34.6  hhh  D01

In [6]:
#Let's learn about Fetchone() and fetchmany()

#cursor.fetchmany(size) returns the number of rows specified by size argument. When called repeatedly, 
#this method fetches the next set of rows of a query result and returns a list of tuples.
#If no more rows are available, it returns an empty list.

import pandas as pd
try:
    sqlconnection=sqlite3.connect("C:\\Users\Geetu Sodhi\\Desktop\Teacher.db")
    cursor=sqlconnection.cursor()
    print("Database connected successfully")
    query="""SELECT * FROM Employee """
    cursor.execute(query)
    
    df = pd.DataFrame(cursor.fetchmany(2))
    print (df)
except sqlite3.Error as error:
    print("Error")

Database connected successfully
   0      1     2    3    4
0  1  Geetu  34.6  hhh  D01
1  2   None  56.7  hhh  D02

In [35]:
#Retreiving Column names along with the data

connection = sqlite3.connect('C:\\Users\Geetu Sodhi\\Desktop\Teacher.db')
cur = connection.cursor()
df = pd.read_sql_query('SELECT * FROM Employee',con=connection)
df.head()

   EID    Name  Salary            JobTitle  DID
0    1   Geetu    34.6                 hhh  D01
1    2    None    56.7                 hhh  D02
2  101    None  4000.0  Software Developer  D01
3  102  Alazar  3500.0    Business Analyst  D01
4  103   Ishan  4200.0      Technical Lead  D01

In [31]:
#Adding data to the Exisisitng file

import pandas as pd
import sqlite3
conn=sqlite3.connect("C:\\Users\\Geetu Sodhi\\Downloads\\Teacher.db")
c = conn.cursor()

d={"EID":[141,412],"Name":["Geetu","Nancy"],"Salary":[3400.6,5600.7],"JobTitle":["hhh","hhh"],"DID":["D01","D02"]}
df2=pd.DataFrame(d)

df2.to_sql('Employee', conn, if_exists='append', index = False)

c.execute(''' Select * from Employee''')

df = pd.DataFrame(c.fetchall())
print (df)

       0          1       2                         3    4
0      1      Geetu  6000.0                       hhh  D01
1      2       None    56.7                       hhh  D02
2    102     Alazar  3500.0          Business Analyst  D01
3    103      Ishan  4200.0            Technical Lead  D01
4    104      Katie  4500.0  Proffesional Coordinator  D02
5    105      Jenet  4500.0              Personal Dev  D03
6    111      Geetu  6000.0                       hhh  D01
7    112      Nancy  5600.7                       hhh  D02
8    115    Olivier  3455.0                QA Analyst  D01
9    120    Olivier  3455.0                QA Analyst  D01
10   130  Ramandeep  3455.0                QA Analyst  D01
11   131       Alex  3465.0              Data Analyst  D01
12   141      Geetu  3400.6                       hhh  D01
13   412      Nancy  5600.7                       hhh  D02
14  1021      Geetu  6000.0                       hhh  D01
15  1031      Geetu  6000.0                       hhh  D01
16  2022      Nancy  5600.7                       hhh  D02
17  2032      Nancy  5600.7                       hhh  D02

In [32]:
#Adding data to the Exsistng file -Let's try with insert command

import pandas as pd
import sqlite3
conn=sqlite3.connect("C:\\Users\\Geetu Sodhi\\Downloads\\Teacher.db")
c = conn.cursor()

sqlquery="""   insert into Employee values(400,"Usman",3555,"QA Analyst","D01")      """

c.execute(sqlquery)

#Committing is very important after insert command otherwise it will not show the result on database

conn.commit()

print("Record inserted succesfully")

c.execute(''' Select * from Employee''')

df = pd.DataFrame(c.fetchall())
print (df)

Record inserted succesfully
       0          1       2                         3    4
0      1      Geetu  6000.0                       hhh  D01
1      2       None    56.7                       hhh  D02
2    102     Alazar  3500.0          Business Analyst  D01
3    103      Ishan  4200.0            Technical Lead  D01
4    104      Katie  4500.0  Proffesional Coordinator  D02
5    105      Jenet  4500.0              Personal Dev  D03
6    111      Geetu  6000.0                       hhh  D01
7    112      Nancy  5600.7                       hhh  D02
8    115    Olivier  3455.0                QA Analyst  D01
9    120    Olivier  3455.0                QA Analyst  D01
10   130  Ramandeep  3455.0                QA Analyst  D01
11   131       Alex  3465.0              Data Analyst  D01
12   141      Geetu  3400.6                       hhh  D01
13   400      Usman  3555.0                QA Analyst  D01
14   412      Nancy  5600.7                       hhh  D02
15  1021      Geetu  6000.0                       hhh  D01
16  1031      Geetu  6000.0                       hhh  D01
17  2022      Nancy  5600.7                       hhh  D02
18  2032      Nancy  5600.7                       hhh  D02

In [17]:
# Can we add multiple rows at once

import pandas as pd
import sqlite3
conn=sqlite3.connect("C:\\Users\\Geetu Sodhi\\Downloads\\Teacher.db")
c = conn.cursor()

sqlquery="""   insert into Employee values(130,"Ramandeep",3455,"QA Analyst","D01"),(131,"Alex",3465,"Data Analyst","D01")       """

c.execute(sqlquery)

#Committing is very important after insert command otherwise it will not show the result on database

conn.commit()

print("Record inserted succesfully")

c.execute(''' Select * from Employee''')

df = pd.DataFrame(c.fetchall())
print (df)

Record inserted succesfully
       0          1       2                         3    4
0      1      Geetu  6000.0                       hhh  D01
1      2       None    56.7                       hhh  D02
2    102     Alazar  3500.0          Business Analyst  D01
3    103      Ishan  4200.0            Technical Lead  D01
4    104      Katie  4500.0  Proffesional Coordinator  D02
5    105      Jenet  4500.0              Personal Dev  D03
6    111      Geetu  6000.0                       hhh  D01
7    112      Nancy  5600.7                       hhh  D02
8    115    Olivier  3455.0                QA Analyst  D01
9    120    Olivier  3455.0                QA Analyst  D01
10   130  Ramandeep  3455.0                QA Analyst  D01
11   131       Alex  3465.0              Data Analyst  D01
12  1021      Geetu  6000.0                       hhh  D01
13  1031      Geetu  6000.0                       hhh  D01
14  2022      Nancy  5600.7                       hhh  D02
15  2032      Nancy  5600.7                       hhh  D02

In [36]:
#Let's learn to update now?

import pandas as pd
import sqlite3
conn=sqlite3.connect("C:\\Users\\Geetu Sodhi\\Downloads\\Teacher.db")
c = conn.cursor()

Name= input("Enter the name of the person for whom you wish to change the salary: ")
Salary=input("Enter the salary:")

sqlquery="""  update Employee set salary=? where Name=?      """
data=(Salary,Name )

c.execute(sqlquery,data)

#Committing is very important after insert command otherwise it will not show the result on database

conn.commit()

print("Record updated succesfully")

c.execute(''' Select * from Employee''')

df = pd.DataFrame(c.fetchall())
print (df)

Enter the name of the person for whom you wish to change the salary: Geetu
Enter the salary:10000
Record updated succesfully
       0          1        2                         3    4
0      1      Geetu  10000.0                       hhh  D01
1      2       None     56.7                       hhh  D02
2    102     Alazar   3500.0          Business Analyst  D01
3    103      Ishan   4200.0            Technical Lead  D01
4    104      Katie   4500.0  Proffesional Coordinator  D02
5    105      Jenet   4500.0              Personal Dev  D03
6    111      Geetu  10000.0                       hhh  D01
7    112      Nancy   5600.7                       hhh  D02
8    115    Olivier   3455.0                QA Analyst  D01
9    120    Olivier   3455.0                QA Analyst  D01
10   130  Ramandeep   3455.0                QA Analyst  D01
11   131       Alex   3465.0              Data Analyst  D01
12   141      Geetu  10000.0                       hhh  D01
13   400      Usman   3555.0                QA Analyst  D01
14   412      Nancy   5600.7                       hhh  D02
15  1021      Geetu  10000.0                       hhh  D01
16  1031      Geetu  10000.0                       hhh  D01
17  2022      Nancy   5600.7                       hhh  D02
18  2032      Nancy   5600.7                       hhh  D02

In [37]:
#Let's learn to delete now...

import pandas as pd
import sqlite3
conn=sqlite3.connect("C:\\Users\\Geetu Sodhi\\Downloads\\Teacher.db")
c = conn.cursor()

#idd= input("Enter the Eid of the person: ")

sqlquery="""  Delete from Employee where Eid=101      """
#data=(idd)

c.execute(sqlquery)

#Committing is very important after insert command otherwise it will not show the result on database

conn.commit()

print("Record updated succesfully")

c.execute(''' Select * from Employee''')

df = pd.DataFrame(c.fetchall())
print (df)

Record updated succesfully
       0          1        2                         3    4
0      1      Geetu  10000.0                       hhh  D01
1      2       None     56.7                       hhh  D02
2    102     Alazar   3500.0          Business Analyst  D01
3    103      Ishan   4200.0            Technical Lead  D01
4    104      Katie   4500.0  Proffesional Coordinator  D02
5    105      Jenet   4500.0              Personal Dev  D03
6    111      Geetu  10000.0                       hhh  D01
7    112      Nancy   5600.7                       hhh  D02
8    115    Olivier   3455.0                QA Analyst  D01
9    120    Olivier   3455.0                QA Analyst  D01
10   130  Ramandeep   3455.0                QA Analyst  D01
11   131       Alex   3465.0              Data Analyst  D01
12   141      Geetu  10000.0                       hhh  D01
13   400      Usman   3555.0                QA Analyst  D01
14   412      Nancy   5600.7                       hhh  D02
15  1021      Geetu  10000.0                       hhh  D01
16  1031      Geetu  10000.0                       hhh  D01
17  2022      Nancy   5600.7                       hhh  D02
18  2032      Nancy   5600.7                       hhh  D02

In [19]:
#How about creating a new table?  Want to try? lets do it

try:
    sqlconnection=sqlite3.connect("C:\\Users\Geetu Sodhi\\Desktop\Teacher.db")
    cursor=sqlconnection.cursor()
    print("Database connected successfully")
    query="""Create table Projects (PID int PRIMARY KEY, Pname Text, PManager Text); """
    cursor.execute(query)
    sqlconnection.commit()
    print("Table created succesfully")
except sqlite3.Error as error:
    print("Error")
finally:
    sqlconnection.close()

Database connected successfully
Table created succesfully

In [ ]:
#Heard about Executemany() .... leaving it for you to explore